#### BooleanOperationsType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing boolean types that are supported for boolean operation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum BooleanOperationsType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration BooleanOperationsType ``` |

| Visual C++ |
| --- |
| ``` public enum class BooleanOperationsType ``` |

# Members

| Member name | Description |
| --- | --- |
| Union | Union. |
| Difference | Difference. |
| Intersect | Intersect. |

# See Also

Autodesk.Revit.DB Namespace